local alpha = require("alpha")
local dashboard = require("alpha.themes.dashboard")

dashboard.section.header.val = {
        "███████╗██╗  ██╗ ██████╗  ██████╗██╗  ██╗██╗      ██████╗ ██████╗ ██████╗",
        "██╔════╝██║  ██║██╔═══██╗██╔════╝██║ ██╔╝██║     ██╔═══██╗██╔══██╗██╔══██╗",
        "███████╗███████║██║   ██║██║     █████╔╝ ██║     ██║   ██║██████╔╝██║  ██║",
        "╚════██║██╔══██║██║   ██║██║     ██╔═██╗ ██║     ██║   ██║██╔══██╗██║  ██║",
        "███████║██║  ██║╚██████╔╝╚██████╗██║  ██╗███████╗╚██████╔╝██║  ██║██████╔╝",
        "╚══════╝╚═╝  ╚═╝ ╚═════╝  ╚═════╝╚═╝  ╚═╝╚══════╝ ╚═════╝ ╚═╝  ╚═╝╚═════╝",
        "                                                       NVIM CONFIG v1",
}

dashboard.section.buttons.val = {
  dashboard.button("e", "  New file",     "<cmd>ene<BAR>startinsert<CR>"),
  dashboard.button("r", "  Recent files", "<cmd>browse oldfiles<CR>"),
  dashboard.button("c", "  Config",       "<cmd>e $MYVIMRC<CR>"),
  dashboard.button("q", "  Quit",         "<cmd>qa<CR>"),
}

alpha.setup(dashboard.config)

vim.api.nvim_create_autocmd("FileType", {
  pattern = "alpha",
  callback = function()
    vim.b.miniindentscope_disable = true
  end,
})
